I've narrowed down the config:
```
# main.tf

locals {
  vpc_inputs = {
    "12345-us-east-1" = {
      "cidr_prefix"     = "10.1",
      "vpc_name_prefix" = "vpc-A",
    }
  }

  vpcs = {
    "12345-us-east-1" = module.account-12345-us-east-1.vpc,
    "56789-us-east-1" = {
      "account_id" = "56789",
      "cidr_block" = "192.168.0.0/24",
      "region"     = "us-east-1",
      "vpc_id"     = "vpc-ghijkl",
      "vpc_name"   = "vpc-B",
    }
  }

  vpc_peering_initiates = {
    "12345-us-east-1" = [
      "56789-us-east-1",
    ]
  }
}

module "account-12345-us-east-1" {
  source = "./account"

  providers = {
    aws = aws.account-12345-us-east-1
  }

  vpc_inputs            = local.vpc_inputs
  vpc_peering_initiates = local.vpc_peering_initiates
  vpcs                  = local.vpcs
}

provider "aws" {
  alias = "account-12345-us-east-1"
  assume_role {
    role_arn = "arn:aws:iam::12345:role/my-role"
  }
  region = "us-east-1"
}
```

```
# ./account/main.tf

provider "aws" {}

variable "vpc_inputs" {
  default = null
}

variable "vpc_peering_initiates" {
  default = null
}

variable "vpcs" {
}

data "aws_caller_identity" "current" {}
data "aws_region" "current" {}

locals {
  account_id = data.aws_caller_identity.current.account_id
  region     = data.aws_region.current.name

  account_region = "${local.account_id}-${local.region}"

  vpc_peering_initiates = {
    for target in var.vpc_peering_initiates[local.account_region] : target => {
      "account_id" = var.vpcs[target]["account_id"],
      "cidr_block" = var.vpcs[target]["cidr_block"],
      "vpc_id"     = var.vpcs[target]["vpc_id"],
      "vpc_name"   = var.vpcs[target]["vpc_name"],
    }
  }
}

module "vpc" {
  source = "../vpc"

  cidr_prefix     = var.vpc_inputs[local.account_region]["cidr_prefix"]
  vpc_name_prefix = var.vpc_inputs[local.account_region]["vpc_name_prefix"]
}

module "vpc_peering_requester" {
  for_each = { for target, vpc_info in local.vpc_peering_initiates : target => vpc_info if target != local.account_region }

  source = "../peering_requester"
}

output "vpc" {
  value = merge(module.vpc.info, {
    "account_id"     = local.account_id,
    "account_region" = local.account_region,
    "region"         = local.region,
  })
}
```

```
# ./vpc/main.tf

variable "cidr_prefix" {
  type = string
}

variable "vpc_name_prefix" {
  type = string
}

data "aws_region" "current" {}

locals {
  vpc_name = "${var.vpc_name_prefix}-${data.aws_region.current.name}"
}

resource "aws_vpc" "main" {
  cidr_block = "${var.cidr_prefix}.0.0/16"
}

output "info" {
  value = {
    "cidr_block" = aws_vpc.main.cidr_block,
    "vpc_id"     = aws_vpc.main.id,
    "vpc_name"   = local.vpc_name,
  }
}
```

and `./peering_requester/main.tf` is just an empty file

terraform plan:
```
$ terraform-0.14 plan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.account-12345-us-east-1.module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.1.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + info = {
      + cidr_block = "10.1.0.0/16"
      + vpc_id     = (known after apply)
      + vpc_name   = "vpc-A-us-east-1"
    }
  + vpc  = {
      + account_id     = "12345"
      + account_region = "12345-us-east-1"
      + cidr_block     = "10.1.0.0/16"
      + region         = "us-east-1"
      + vpc_id         = (known after apply)
      + vpc_name       = "vpc-A-us-east-1"
    }

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

terraform import
```
$ terraform-0.14 import module.account-12345-us-east-1.module.vpc.aws_vpc.main vpc-abcdef
module.account-12345-us-east-1.module.vpc.aws_vpc.main: Importing from ID "vpc-abcdef"...
module.account-12345-us-east-1.module.vpc.aws_vpc.main: Import prepared!
  Prepared aws_vpc for import
module.account-12345-us-east-1.module.vpc.aws_vpc.main: Refreshing state... [id=vpc-abcdef]

Error: Invalid for_each argument

  on account/main.tf line 41, in module "vpc_peering_requester":
  41:   for_each = { for target, vpc_info in local.vpc_peering_initiates : target => vpc_info if target != local.account_region }

The "for_each" value depends on resource attributes that cannot be determined
until apply, so Terraform cannot predict how many instances will be created.
To work around this, use the -target argument to first apply only the
resources that the for_each depends on.
```